# CannotReloadFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..CannotReloadFile Property
BuiltInFailures..::..LinkFailures Class See Also
---
Can't reload file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotReloadFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotReloadFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotReloadFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace